### DBMS분류 
- 계층형 DBMS : 트리 형태
- 망형 DBMS
- 관계형 DBMS : RDBMS, 대부분의 DBMS, 테이블 구성(열, 행)

### 폭포수 모델 : 각 단계가 구분되어 프로젝트의 진행 단계가 명확. but 앞 단계로 돌아가기가 어려움
- 1. 프로젝트 계획 : 마트의 물건을 온라인으로 판매하기 위해 계획
- 2. 업무 분석 : 마트에서의 업무 파악 (어떻게 물건을 들이는가? 물건을 어떻게 계산하는가?)
- 3. 시스템 설계 : 업무 분석을 컴퓨터에 적용시키기 위해 더듬는 과정
- 4. 프로그램 구현 : 실제 프로그래밍 언어로 코딩
- 5. 테스트 : 코딩된 프로그램에 오류 확인
- 6. 유지보수 : 운영하면서 기능 보완, 추가

## 데이터베이스 모델링 : 현실세계 작업을 DBMS의 개체로 전환

### 데이터베이스 구성
- 데이터 : 하나의 단편적 정보
- 테이블 : 데이터를 입력하기 위해 표 형태로 표현
- 데이터베이스 : 테이블이 저장되는 저장소
- DBMS : 데이터베이스 관리 시스템 (MySQL)
- 열 : 테이블 세로
- 열 이름
- 데이터 형식 : 정수, 문자, 실수 etc
- 행 : 실질적인 데이터
- 기본 키 (Primary key) : 행을 구분하는 유일한 열, 중복X, 공백X (ID, 주민번호)
- SQL : 구조화된 질의 언어

데디터베이스 생성 : [Schemas] - 마우스 우클릭 [Create Schemas]

테이블 생성 : [File] - [New Model] - [Add Diagram] - Place a new table (단축키 : t) - 클릭

### 데이터베이스 구축 절차
1. 데이터베이스 생성
2. 테이블 생성
3. 데이터 입력/수정/삭제
4. 데이터 조회/활용

(스키마 = 데이터베이스)

#### 테이블 생성
- 선택 스키마 -> Tables 우클릭 -> Create Table -> Apply
- PK : 기본키, NN (Not Null)

#### 데이터 입력 : 선택 테이블 우클릭 -> Select Rows -> Result Grid에 입력 -> Apply
```sql
INSERT INTO 테이블명 VALUES( ‘ ’, ‘ ’, ... )
```
#### 데이터 삭제 : Result Grid내 행 우클릭 -> Delete Row
- 기본 키 – 외래 키 관계로 연결된 테이블은, 외래 키가 설정된 테이블을 먼저 삭제

In [ ]:
library(tidyverse)
library(RMySQL)

### ```CREATE DATABASE``` : DB 생성

In [7]:
dbGetQuery(conn, "CREATE DATABASE SSOL")

In [8]:
dbGetQuery(conn, "USE SSOL")

### ```CREATE TABLE``` : 테이블 생성

### 데이터 형식

#### 1. 정수형
| **데이터 형식** | **바이트** | **범위** |
| -- | -- |-- | 
| TINYINT | 1 | -127 ~ 127 |
| SMALLINT | 2 | -32768 ~ 32767 |
| INT | 4 | -21억 ~ 21억 |
| BIGINT | 8 | -900경 ~ 900경 |

### ```UNSIGNED``` : 정수형 값의 범위가 0부터 시작

#### 2. 문자형
| **데이터 형식** | **바이트** | |
| -- | -- | -- |
| CHAR | 1 ~ 255 | 고정길이 문자형 |
| VARCHAR | 1 ~ 16383 | 가변길이 문자형 | 

#### 3. 대량 데이터
| **데이터 형식** | **바이트** | **범위** |
| -- | -- | -- |
| TEXT | TEXT  | 1 ~ 65535 |
| | LONGTEXT  | 1 ~ 4294967295 |
| BLOB [이미지/동영상/데이터] | BLOB | 1 ~ 65535 |
| | LONGBLOB | 1 ~ 4294267295 |

#### 4. 실수형
| **데이터 형식** | **바이트** | |
| -- | -- | -- |
| FLOAT | 4 | 소수점 아래 7자리까지 표현 |
| DOUBLE | 8 | 소수점 아래 15자리까지 표현 |

#### 5. 날짜형
| **데이터 형식** | **바이트** | |
| -- | -- | -- |
| DATE | 3 | YYYY-MM-DD | 
| TIME | 3 | HH:MM:SS | 
| DATETIME | 8 | YYYY-MM-DD HH:MM:SS |

In [91]:
dbGetQuery(conn, "CREATE TABLE table2 (
                  id INT NOT NULL PRIMARY KEY,
                  col1 INT UNSIGNED NULL,
                  col2 FLOAT NULL,
                  col3 VARCHAR(45) NULL)")

### ```CREATE TABLE AS SELECT```

In [88]:
# city의 테이블로 city2를 생성
dbGetQuery(conn, "CREATE TABLE city2 AS SELECT * FROM city;")
dbGetQuery(conn, "SELECT * FROM city2;")

  ID Name     CountryCode District Population
1 1  Kabul    AFG         Kabol    1780000
2 2  Qandahar AFG         Qandahar  237500
3 3  Herat    AFG         Herat     186800

### 데이터 형 변환 : 문자를 정수형 or 정수를 문자형으로
### ```CAST ~ AS``` / ```CONVERT``` : 함수를 사용한 명시적인 변환

**buy테이블의 price에 대한 평균을, 부호가 있는 정수(SIGNED)로 변환**

In [147]:
dbGetQuery(conn, "SELECT CAST(AVG(price) AS SIGNED) 'AVG' FROM market_db.buy;")
dbGetQuery(conn, "SELECT CONVERT(AVG(price), SIGNED) 'AVG' FROM market_db.buy;")

  AVG
1 143

  AVG
1 143

In [148]:
dbGetQuery(conn, "SELECT CAST('2022$12$12' AS DATE);")

  CAST('2022$12$12' AS DATE)
1 2022-12-12

#    

## 기본키/외래키

### 제약조건 : 데이터의 무결성을 지키기 위한 조건
#### 데이터의 무결성 : 데이터의 결함이 없음 (중복, 공백 등)

### ```PRIMARY KEY``` : 기본키
- 기본 키 입력값은 중복X, 
- NULL X
- 테이블당 1개

#### 기본키 설정

1. 테이블 생성시 설정

In [31]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL PRIMARY KEY);")

2. 테이블 생성에서 CONSTRAINT PRIMARY KEY로 제약조건 설정

In [112]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL, 
                  CONSTRAINT PRIMARY KEY (mem_id));")

3. 테이블 생성이후 ALTER TABLE로 제약조건 추가(수정)

In [124]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL);")
dbGetQuery(conn, "ALTER TABLE member
                  ADD CONSTRAINT PRIMARY KEY (mem_id);")

### ```INSERT``` :  테이블 이름 다음에 나오는 열 생략 가능 
- 생략할 경우 VALUE 다음에 나오는 값들의 순서 및 개수가 테이블이 정의된 열 순서 및 개수와 동일해야 함

### ```INSERT INTO ~ VALUES``` : 데이터 입력

In [126]:
dbGetQuery(conn, "INSERT INTO member VALUES ('SPC')")

In [127]:
dbGetQuery(conn, "SELECT * FROM member")

  mem_id
1 SPC

### ```INSERT INTO ~ SELECT``` : 다른 테이블의 데이터를 한 번에 입력

**wolrd DB의 city테이블의 Name, Population 컬럼을 popul로 입력**

In [136]:
dbGetQuery(conn, "CREATE TABLE popul (
                  name CHAR(35), population INT);")
dbGetQuery(conn, "INSERT INTO popul
                  SELECT Name, Population FROM world.city;")

In [129]:
dbGetQuery(conn, "SELECT * FROM popul")

  name     population
1 Kabul    1780000
2 Qandahar  237500
3 Herat     186800

### ```ALTER TABLE``` : 테이블 수정

### ```ADD``` : 추가
### ```MODIFY``` : 수정
### ```DROP``` : 삭제

In [92]:
# table2에 col4 추가, col2의 type변환, col3을 삭제
dbGetQuery(conn, "ALTER TABLE table2
                  ADD col4 INT NULL, 
                  MODIFY col2 VARCHAR(20) NULL,
                  DROP col3")

- 자동 입력 시작값을 1000, 간격을 3으로 변경

In [105]:
dbGetQuery(conn, "ALTER TABLE tt AUTO_INCREMENT = 1000")
dbGetQuery(conn, "SET @@AUTO_INCREMENT_INCREMENT = 3;")

### ```UPDATE``` : 기존에 입력되어 있는 값 변경
- WHERE절 생략 가능하나 테이블의 전채 행 내용 변경

**city_popul테이블에서 city_name이 ‘New York’인 데이터의 city_name과 population을 각각 ‘뉴욕’, 0으로 수정**

In [140]:
dbGetQuery(conn, "UPDATE popul
                  SET name = 'NY', population = 0
                  WHERE name = 'New York'")

In [141]:
dbGetQuery(conn, "SELECT * FROM popul
                  WHERE name = 'NY'")

  name population
1 NY   0

### ```DELETE FROM``` : 행 단위로 데이터 삭제하는 구문
- WHERE 생략시 전체 삭제
- 데이터는 지워지지만 테이블 용량은 줄지 않음
- 원하는 데이터만 삭제
- 삭제 후 복구 가능

**popul 테이블에서 name이 'New'로 시작하는 모든 데이터 삭제**

In [142]:
dbGetQuery(conn, "DELETE FROM popul
                  WHERE name LIKE 'New%';")

### ```TRUNCATE``` : 테이블의 구조는 남기고, 행 전부 삭제 (초기화)
- 한거번에 다 삭제
- 삭제 후 복구 불가

### ```DROP TABLE``` : 테이블 전체를 삭제, 공간, 객체를 삭제
- 삭제 후 복구 불가

### ```DROP DATABASE``` : DB삭제 

###

### ```FOREIGN KEY``` : 외래키
- 기준 테이블 : 기본 키가 있는 테이블
- 참조 테이블 : 외래 키가 있는 테이블
- 참조 테이블이 참조하는 기준 테이블의 열은 기본키 or 고유키 

#### 외래키 지정
### ```FOREIGN KEY(외래키 열) REFERENCE 기준테이블(기본키_열)```

1.

In [75]:
# buy테이블의 user_id를, member테이블의 mem_id를 참조하여 외래키로 설정
dbGetQuery(conn, "CREATE TABLE buy (
                  num INT AUTO_INCREMENT NOT NULL PRIMARY KEY,
                  user_id CHAR(8) NOT NULL,
                  FOREIGN KEY(user_id) REFERENCES member(mem_id))")

2.

In [94]:
# buy테이블 생성 => ALTER TABLE로 테이블 수정 => ADD CONSTRAINT로 제약조건을 추가 => - buy테이블의 user_id를, member테이블의 mem_id를 참조하여 외래키로 설정
dbGetQuery(conn, "CREATE TABLE buy (
                  num INT AUTO_INCREMENT NOT NULL PRIMARY KEY,
                  user_id CHAR(8) NOT NULL);")
dbGetQuery(conn, "ALTER TABLE buy 
                  ADD CONSTRAINT
                  FOREIGN KEY(user_id) REFERENCES member(mem_id)")

### ```UNIQUE``` : 고유키, 중복되지 않는 유일한 값
- NULL 가능
- 테이블에 여러개 가능
- 데이터 입력 시 중복되는 데이터가 있다면 오류

In [117]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL PRIMARY KEY,
                  email CHAR(30) NULL UNIQUE);")

### ```AUTO_INCREMENT``` : 자동으로 1부터 증가하는 값 입력
- **PRIMARY KEY에만 적용 가능**
- 데이터 입력시에 해당 열은 NULL값으로 채워 넣음

In [104]:
dbGetQuery(conn, "CREATE TABLE tt (
                  id INT AUTO_INCREMENT PRIMARY KEY,
                  name CHAR(4),
                  age INT);")

#### ```SELECT LAST_INSERT_ID``` : 자동증가로 어느 숫자까지 증가됬는지 확인

In [102]:
dbGetQuery(conn, "INSERT INTO tt VALUES (NULL, 'b', 21);")
dbGetQuery(conn, "SELECT LAST_INSERT_ID();")

  LAST_INSERT_ID()
1 1

### ```CHECK``` : 입력되는 데이터를 점검
- 열에 조건을 설정

**member 테이블의 height열은 100이상의 값만 입력 가능한 조건 설정**

In [118]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL PRIMARY KEY,
                  mem_name VARCHAR(10) NOT NULL,
                  height TINYINT UNSIGNED NULL CHECK (height >= 100),
                  phone CHAR(3) NULL);")

**member 테이블의 phone열은 ('02', '031', '032', '054', '055', '061')중 에서만 입력가능한 제약 조건 추가**

In [119]:
dbGetQuery(conn, "ALTER TABLE member
                  ADD CONSTRAINT
                  CHECK (phone IN ('02', '031', '032', '054', '055', '061'));")

### ```DEFAULT``` : 기본값
- 값을 입력하지 않았을 때 자동으로 입력될 값을 미리 지정

**member 테이블의 height열의 default 값을 160으로 설정**

In [151]:
dbGetQuery(conn, "CREATE TABLE member (
                  mem_id CHAR(8) NOT NULL PRIMARY KEY,
                  height TINYINT UNSIGNED NULL DEFAULT 160,
                  phone CHAR(3) NULL);")

**member 테이블의 phone열의 default값을 '02'로 설정**

In [121]:
dbGetQuery(conn, "ALTER TABLE member
                  ALTER COLUMN phone SET DEFAULT '02'")

In [122]:
dbGetQuery(conn, "INSERT INTO member VALUES('SPC', default, default)")

In [123]:
dbGetQuery(conn, "SELECT * FROM member")

Warning message in .local(conn, statement, ...):
"Unsigned INTEGER in col 1 imported as numeric"

  mem_id height phone
1 SPC    160    02

### 열 이름 변경 / 열 삭제
- 기본키 - 외래키로 맺어진 후에는, 기준 테이블의 기본키 이름 변경 불가
- 기준 테이블의 기본키 열 삭제도 불가
- 이를 보완하기 위해 ```ON UPDATE CASCADE```, ```ON DELETE CASCADE```필요

### ```ON UPDATE CASCADE``` : 기준 테이블과 참조 테이블의 수정이력이 연동
### ```ON DELETE CASCADE``` : 기준 테이블과 참조 테이블의 삭제이력이 연동

In [152]:
dbGetQuery(conn, "CREATE TABLE buy (
                  num INT AUTO_INCREMENT NOT NULL PRIMARY KEY,
                  user_id CHAR(8) NOT NULL,
                  name CHAR(6) NOT NULL);")

In [153]:
dbGetQuery(conn, "ALTER TABLE buy
                  ADD CONSTRAINT
                  FOREIGN KEY(user_id) REFERENCES member(mem_id)
                  ON UPDATE CASCADE
                  ON DELETE CASCADE;")

In [175]:
dbGetQuery(conn, "SELECT * FROM member")
dbGetQuery(conn, "SELECT * FROM buy")

Warning message in .local(conn, statement, ...):
"Unsigned INTEGER in col 1 imported as numeric"

  mem_id height phone
1 BLK    160    111

  num user_id name
1 1   BLK     AAA

**기준 테이블(member)에서 mem_id가 ‘BLK’인 데이터를 ‘PINK’로 변경**

**자동으로 참조 테이블에도 적용**

In [176]:
dbGetQuery(conn, "UPDATE member SET mem_id = 'PINK'
                  WHERE mem_id = 'BLK'")
dbGetQuery(conn, "SELECT * FROM member")
dbGetQuery(conn, "SELECT * FROM buy")

Warning message in .local(conn, statement, ...):
"Unsigned INTEGER in col 1 imported as numeric"

  mem_id height phone
1 PINK   160    111

  num user_id name
1 1   PINK    AAA

In [177]:
dbGetQuery(conn, "DELETE FROM member WHERE mem_id = 'PINK'")
dbGetQuery(conn, "SELECT * FROM member")
dbGetQuery(conn, "SELECT * FROM buy")

Warning message in .local(conn, statement, ...):
"Unsigned INTEGER in col 1 imported as numeric"

     mem_id height phone

     num user_id name

**기준 테이블(member)에서 mem_id가 ‘PINK’인 데이터를 삭제**

**자동으로 참조 테이블에도 적용**

### 변수선언

In [181]:
dbGetQuery(conn, "SET @A = 10")
dbGetQuery(conn, "SELECT @A")

  @A
1 10